let questions = [
    {
        "question":"你注意到旁邊有一個乾淨的小池塘，要不要喝點水呢？",  // 1
        "answers":[
            ["喝光光！","B"],
            ["不要",2],
            ["假裝沒看到",2]
        ]
    },
    {
        "question":"你發現一根水分飽滿的胡蘿蔔，該不該吃掉它呢？",  // 2
        "answers":[
            ["吃都吃！","C"],
            ["不要",3],
            ["假裝沒看到",3]
        ]
    },
    {
        "question":"因為不知明的原因，你現在必須得經過一個鐵籠子，你跟怎麼辦呢？",  // 3
        "answers":[
            ["腳才不會痛呢！看我馬上跳過去！","D"],
            ["雖然腳會有點痛但也只好趕快跳過去了",5],
            ["蹲坐在原地思考兔生",4]
        ]
    },
    {
        "question":"因為不知明的原因，你現在又必須得經過一個鐵籠子，你跟怎麼辦呢？",  // 4
        "answers":[
            ["腳才不會痛呢！看我馬上跳過去！","D"],
            ["雖然腳會有點痛但也只好趕快跳過去了",5],
            ["蹲坐在原地思考兔生",4]
        ]
    },
    {
        "question":"因為不知明的原因，你現在突然出現在一個1.5m高的大塑膠箱裡，你跟怎麼辦呢？",  // 5
        "answers":[
            ["跳出去",7],
            ["我才跳不出去呢！ 。･ﾟ･(つд`ﾟ)･ﾟ･","E"],
            ["我不做兔子啦，箱子！",6]
        ]
    },
    {
        "question":"因為不知明的原因，不是兔子的你突然又出現在一個1.5m高的大塑膠箱裡，你跟怎麼辦呢？",  // 6
        "answers":[
            ["跳出去",7],
            ["不是兔子的我才跳不出去呢！ 。･ﾟ･(つд`ﾟ)･ﾟ･","E"],
            ["好啦我做回兔兔啦 (´;ω;`)",5]
        ]
    },
    {
        "question":"你終於回歸了你的冒險，可你用靈敏的耳朵突然發現前方有一顆氣球，它應該是什麼顏色呢？",  // 7
        "answers":[
            ["兔兔才看不到前方不知道",8],
            ["是彩虹的顏色！ ","F"],
            ["兔兔問號",8]
        ]
    },
    {
        "question":"這是題冒險中的送分題",  // 8
        "answers":[
            ["好喔",9],
            ["兔兔才不認識送分題",9],
            ["兔兔問號",9]
        ]
    },
    {
        "question":"突然間天地驟變，一道閃電轟的一聲打在你的面前！",  // 9
        "answers":[
            ["嚇到死掉",10],
            ["是閃電耶！","G"],
            ["是幾萬安培電漿態的空氣介質耶！","G"]
        ]
    },
    {
        "question":"一道光芒把你復活了，在你感到問號的同時你突然意識到這段冒險快結束了，頓時一頓寂寞感襲來",  // 10
        "answers":[
            ["寂寞到死掉","A"],
            ["發呆","H"],
            ["繼續思考自己怎麼活過來的","H"]
        ]
    }
    
];

let finalAnswers={
        "A":["一道神奇的光芒又把你復活了","恭喜你！你是隻標準的兔兔！兔兔系出身的你對於兔兔的了解與知識超出常人！"],
        "B":["哎呀  兔兔變成靈魂飛走了呢","兔兔一天中不能攝取太多水份喔，喝太多的話兔兔的胃會出問題然後就會死掉的！"],
        "C":["哎呀  兔兔變成靈魂飛走了呢","兔兔其實不太能吃胡蘿蔔喔，胡蘿蔔裡的水份太多兔兔會死掉的！"],
        "D":["腳好痛！","兔兔的腳底沒有肉球，所以在經過不好走的地形時腳會痛痛的，痛久了腳就會有問題，所以不建議用鐵籠子養兔兔喔！"],
        "E":["你的腦袋突然出現一股聲音","兔兔的跳躍力是很驚人的，平常在箱子裡不出去只是因為他不想出去(或太肥)而已，不要小看兔兔啊！"],
        "F":["兔兔的世界裡沒有前方！", "兔兔的眼睛是看不見正前方的喔，但是靈敏的耳朵卻可以聽到很微小的聲音很厲害的！"],
        "G":["啊咧？ 我怎麼飛走了？","兔兔的心臟很脆弱，一不小心的刺激都有可能導致他們嚇到休克，所以在跟兔兔相處的時候記得慢慢來喔！"],
        "H":["啊咧？ 我怎麼飛走了？","兔兔很怕寂寞的，記得常常陪他們玩或幫他們找個玩伴，不然太寂寞他們會死掉喔！"]
};